app/views/messages/show.html.erb

<p><strong>Chat:</strong> <%= link_to "Chat ##{@message.chat.id}", chat_path(@message.chat) %></p>
<p><strong>User:</strong> <%= link_to @message.user.first_name, user_path(@message.user) %></p>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 15 LIMIT 1