app/views/users/index.html.erb

SELECT COUNT(*) FROM "messages" WHERE "messages"."user_id" = 1
---
        <td><%= user.last_name %></td>
        <td><%= user.messages.count %></td>