app/views/users/show.html.erb

SELECT "chats".* FROM "chats" WHERE (sender_id = 15 OR receiver_id = 15)
---
<ul>
  <% @user.chats.each do |chat| %>

SELECT "messages".* FROM "messages" WHERE "messages"."user_id" = 15
---
<ul>
  <% @user.messages.each do |msg| %>