app/views/chats/show.html.erb

<ul>
  <% @chat.messages.each do |msg| %>
    <li>
      <%= msg.body %> - by <%= msg.user.first_name %>
---
SELECT "messages".* FROM "messages" WHERE "messages"."chat_id" = 11
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1