app/controllers/chats_controller.rb

  def index
    @chats = Chat.all
---
SELECT "chats".* FROM "chats" WHERE (sender_id = 15 OR receiver_id = 15)

  def show
    @chat = Chat.find(params[:id])
---
SELECT "chats".* FROM "chats" WHERE "chats"."id" = 11 LIMIT 1

  def new
    @chat = Chat.new
    @users = User.all
---
SELECT "users".* FROM "users"

  def create
    @chat = Chat.new(chat_params)
    if @chat.save
---
INSERT INTO "chats" ("sender_id", "receiver_id", "created_at", "updated_at") VALUES (15, 1, '2025-06-13 23:07:17.100554', '2025-06-13 23:07:17.100554') RETURNING "id"

  def edit
    @chat = Chat.find(params[:id])
---
SELECT "chats".* FROM "chats" WHERE "chats"."id" = 11 LIMIT 1