app/controllers/messages_controller.rb

SELECT "chats".* FROM "chats"
SELECT "users".* FROM "users"
---
  def new
    @message = Message.new
    @chats = Chat.all
    @users = User.all

INSERT INTO "messages" ("chat_id", "user_id", "body", "created_at", "updated_at") VALUES (9, 15, 'vdsdfvfvdf', '2025-05-30 00:54:58.538659', '2025-05-30 00:54:58.538659') RETURNING "id"
---
  def create
    @message = Message.new(message_params)
    if @message.save