app/controllers/users_controller.rb

INSERT INTO "users" ("email", "first_name", "last_name", "created_at", "updated_at") VALUES ('asdfasdf@sdfasdfasd', 'aesdfasdf', 'asdfasdf', '2025-05-15 16:54:37.319454', '2025-05-15 16:54:37.319454') RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save